iNavFlight/inav/lib/main/STM32H5/Drivers/BSP/STM32H573I-DK/stm32h573i_discovery_lcd.c
/**
  ******************************************************************************
  * @file    stm32h573i_discovery_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on STM32H573I-DK board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************

  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) This driver is used to drive indirectly an LCD TFT.
   (#) This driver supports the LS016B8UY LCD.
   (#) The LS016B8UY component driver MUST be included with this driver.

  [..] Driver description:
   (#) Initialization steps:
       (++)Initialize the LCD using the BSP_LCD_Init() function.

   (#) Display on LCD
       (++) Clear the hole LCD using BSP_LCD_Clear() function or only one specified string
            line using the BSP_LCD_ClearStringLine() function.

       (++) Display a character on the specified line and column using the BSP_LCD_DisplayChar()
            function or a complete string line using the BSP_LCD_DisplayStringAtLine() function

       (++) Display a string line on the specified position (x,y in pixel) and align mode
            using the BSP_LCD_DisplayStringAtLine() function.

       (++) Draw and fill a basic shapes (dot, line, rectangle, circle, ellipse, .. bitmap)
            on LCD using the available set of functions.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h573i_discovery_lcd.h"
#include "stm32h573i_discovery_bus.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32H573I_DK
  * @{
  */

/** @defgroup STM32H573I_DK_LCD LCD
  * @{
  */

/** @defgroup STM32H573I_DK_LCD_Exported_Variables LCD Exported Variables
  * @{
  */
void               *Lcd_CompObj[LCD_INSTANCES_NBR] = {NULL};
LCD_Drv_t          *Lcd_Drv[LCD_INSTANCES_NBR] = {NULL};
SRAM_HandleTypeDef hlcd_sram[LCD_INSTANCES_NBR];
BSP_LCD_Ctx_t      Lcd_Ctx[LCD_INSTANCES_NBR];
/**
  * @}
  */
/** @defgroup STM32H573I_DK_LCD_Private_Types LCD Private Types
  * @{
  */
const LCD_UTILS_Drv_t LCD_Driver =
{
  BSP_LCD_DrawBitmap,
  BSP_LCD_FillRGBRect,
  BSP_LCD_DrawHLine,
  BSP_LCD_DrawVLine,
  BSP_LCD_FillRect,
  BSP_LCD_ReadPixel,
  BSP_LCD_WritePixel,
  BSP_LCD_GetXSize,
  BSP_LCD_GetYSize,
  NULL,
  BSP_LCD_GetPixelFormat
};

/**
  * @}
  */

/** @defgroup STM32H573I_DK_LCD_Private_Defines LCD Private Defines
  * @{
  */
#define LCD_REGISTER_ADDR  FMC_BANK1_1
#define LCD_DATA_ADDR     (LCD_REGISTER_ADDR | 0x00000002UL)

#define LCD_FMC_ADDRESS  ((uint16_t)1)
/**
  * @}
  */

/** @defgroup STM32H573I_DK_LCD_Private_FunctionPrototypes LCD Private Functions Prototypes
  * @{
  */
static int32_t ST7789H2_Probe(uint32_t Orientation);

static int32_t LCD_FMC_Init(void);
static int32_t LCD_FMC_DeInit(void);
static int32_t LCD_FMC_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint32_t Length);
static int32_t LCD_FMC_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint32_t Length);
static int32_t LCD_FMC_Send(uint8_t *pData, uint32_t Length);
static int32_t LCD_FMC_GetTick(void);

static void ST7789H2_PowerUp(void);
static void ST7789H2_PowerDown(void);
static void FMC_BANK1_MspInit(SRAM_HandleTypeDef *hsram);
static void FMC_BANK1_MspDeInit(SRAM_HandleTypeDef *hsram);

/**
  * @}
  */

/** @defgroup STM32H573I_DK_LCD_Exported_Functions LCD Exported Functions
  * @{
  */

/**
  * @brief  Initializes the LCD with a given orientation.
  * @param  Instance    LCD Instance
  * @param  Orientation LCD_ORIENTATION_PORTRAIT, LCD_ORIENTATION_PORTRAIT_ROT180
  *         LCD_ORIENTATION_LANDSCAPE or LCD_ORIENTATION_LANDSCAPE_ROT180
  * @retval BSP status
  */
int32_t BSP_LCD_Init(uint32_t Instance, uint32_t Orientation)
{
  int32_t ret;

  if((Orientation > LCD_ORIENTATION_PORTRAIT) || (Instance >= LCD_INSTANCES_NBR))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Lcd_Ctx[Instance].PixelFormat = LCD_PIXEL_FORMAT_RGB565;
    Lcd_Ctx[Instance].XSize       = LCD_DEFAULT_WIDTH;
    Lcd_Ctx[Instance].YSize       = LCD_DEFAULT_HEIGHT;

    /* Initialize LCD special pins GPIOs */
    ST7789H2_PowerUp();

    if(ST7789H2_Probe(Orientation) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_UNKNOWN_COMPONENT;
    }
    else
    {
      ret = BSP_LCD_DisplayOn(Instance);
    }
  }

  return ret;
}

/**
  * @brief  DeInitializes the LCD.
  * @param  Instance    LCD Instance
  * @retval BSP status
  */
int32_t BSP_LCD_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Lcd_Drv[Instance]->DeInit(Lcd_CompObj[Instance]) < 0)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {  
    ST7789H2_PowerDown();

#if (USE_HAL_SRAM_REGISTER_CALLBACKS == 0)
    /* SRAM controller de-initialization */
    FMC_BANK1_MspDeInit(&hlcd_sram[Instance]);
#endif /* (USE_HAL_SRAM_REGISTER_CALLBACKS == 0) */

    /* De-Init the SRAM */
    (void)HAL_SRAM_DeInit(&hlcd_sram[Instance]);
  }

  return ret;
}

/**
  * @brief  Initializes LCD IOs.
  * @param  hsram SRAM handle
  * @retval HAL status
  */
__weak HAL_StatusTypeDef MX_FMC_BANK1_Init(SRAM_HandleTypeDef *hsram)
{
  static FMC_NORSRAM_TimingTypeDef  sram_timing = {0};

  /* SRAM device configuration */
  hsram->Init.DataAddressMux         = FMC_DATA_ADDRESS_MUX_DISABLE;
  hsram->Init.MemoryType             = FMC_MEMORY_TYPE_SRAM;
  hsram->Init.MemoryDataWidth        = FMC_NORSRAM_MEM_BUS_WIDTH_16;
  hsram->Init.BurstAccessMode        = FMC_BURST_ACCESS_MODE_DISABLE;
  hsram->Init.WaitSignalPolarity     = FMC_WAIT_SIGNAL_POLARITY_LOW;
  hsram->Init.WaitSignalActive       = FMC_WAIT_TIMING_BEFORE_WS;
  hsram->Init.WriteOperation         = FMC_WRITE_OPERATION_ENABLE;
  hsram->Init.WaitSignal             = FMC_WAIT_SIGNAL_DISABLE;
  hsram->Init.ExtendedMode           = FMC_EXTENDED_MODE_DISABLE;
  hsram->Init.AsynchronousWait       = FMC_ASYNCHRONOUS_WAIT_DISABLE;
  hsram->Init.WriteBurst             = FMC_WRITE_BURST_DISABLE;
  hsram->Init.ContinuousClock        = FMC_CONTINUOUS_CLOCK_SYNC_ONLY;
  hsram->Init.WriteFifo              = FMC_WRITE_FIFO_DISABLE;
  hsram->Init.PageSize               = FMC_PAGE_SIZE_NONE;
  hsram->Init.NBLSetupTime           = FMC_NBL_SETUPTIME_0;
  hsram->Init.MaxChipSelectPulse     = DISABLE;
  hsram->Init.MaxChipSelectPulseTime = 1;

  sram_timing.AddressSetupTime       = 10;
  sram_timing.AddressHoldTime        = 7;
  sram_timing.DataSetupTime          = 7;
  sram_timing.DataHoldTime           = 2;
  sram_timing.BusTurnAroundDuration  = 4;
  sram_timing.CLKDivision            = 2;
  sram_timing.DataLatency            = 2;
  sram_timing.AccessMode             = FMC_ACCESS_MODE_A;

  return HAL_SRAM_Init(hsram, &sram_timing, &sram_timing);
}

/**
  * @brief  Gets the LCD Active LCD Pixel Format.
  * @param  Instance    LCD Instance
  * @param  PixelFormat Active LCD Pixel Format
  * @retval BSP status
  */
int32_t BSP_LCD_GetPixelFormat(uint32_t Instance, uint32_t *PixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;

